Tekla Open API Reference for Tekla Structures 2025
AnalysisPartEnd Class
 The AnalysisPartEnd class contains information related to analysis part ends.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisPartEnd
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPartEnd
Public NotInheritable Class AnalysisPartEnd
The AnalysisPartEnd type exposes the following members.
Constructors
Name | Description
AnalysisPartEnd
Initializes a new instance of the AnalysisPartEnd class
Top
Properties
Name | Description
Condition
 The condition of the part end.
Connectivity
 The connectivity of the part end.
Eccentricity
 The eccentricity of the part end (in the local coordinate system).
EccentricityMode
 The eccentricity mode of the part end.
Support
 The support of the part end.
SupportCoordSystem
 The coordinate system of the support.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace